GetVendorURLApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:get="http://j2ee.netbeans.org/wsdl/GetVendorURL/src/getVendor">
  <soapenv:Body>
    <get:getVendorOperation>
      <vendorName>adms</vendorName>
      <userName>adms1</userName>
      <opName>CIM_DER (createDERGroupDispatch)</opName>
    </get:getVendorOperation>
  </soapenv:Body>
</soapenv:Envelope>